app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy
    @article = Article.find(params[:id])
    # POPUP TO SHOW ACTION PERFORMED
    flash.notice = "Article '#{@article.title}' has been Deleted!"

    @article.destroy